Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00100.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>BROMC</name>
         <version>044022a0</version>
         <description>ARM GF55LPx Boot ROM Controller Macro</description>
         <baseAddress>0x44804000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A REGISTER</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable ROM read access and power down the ROM. The ROM PGEN input is driven high. The ROM will clamp outputs to 1 and disable all internal current sinks. Refer to the ROM compiler specification for details on powering down the ROM.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable ROM read access, power up the ROM. The ROM PGEN input is driven low.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>Privileged Access Only</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRIVSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Macro register accessible in privileged and unprivileged modes</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Macro registers only accessible in privileged mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRMWS</name>
                     <description>ROM Access Time Wait State</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PRMWSSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No wait states, single cycle access</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Access time extended 2 clock cycles</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Access time extended to 3 clock cycles</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>Access time extended to 8 clock cycles</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>UCFG</name>
               <description>User Configuration REGISTER</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>BCRCDIS</name>
                     <description>Boot CRC Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BCRCDISSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Boot ROM content is CRC verified by the ROM controller, status is reported to the DSU. On CRC failure, the controller blocks access to the ROM controller.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No CRC verification at Boot.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>CAN0</name>
         <version>050101a0</version>
         <description>Control Area Network</description>
         <groupName>CAN</groupName>
         <prependToName>CAN_</prependToName>
         <baseAddress>0x4402E000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2B4</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CAN0_INT0</name>
            <value>35</value>
         </interrupt>
         <interrupt>
            <name>CAN0_INT1</name>
            <value>36</value>
         </interrupt>
         <interrupt>
            <name>CAN0_BERR</name>
            <value>37</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>Priveged Access</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run during standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>Control B Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET</name>
                     <description>Message RAM Base Address Offset.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>DBG</name>
                     <description>Debug Message Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Bus Error Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>DBG</name>
                     <description>Debug Message Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Bus Error Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>DBG</name>
                     <description>Debug Message Reception</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>AHB Bus Error Detection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAGSET</name>
               <description>Interrupt Flag Software Set Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>DBG</name>
                     <description>Debug Message Interrupt Flag Set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>AHB Bus Error Detection Interrupt Flag Set</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>SYNCBUSY Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Synchronization Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CREL_MCAN</name>
               <description>Core Release</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x33000000</resetValue>
               <fields>
                  <field>
                     <name>DAY</name>
                     <description>Timestamp day</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MON</name>
                     <description>Timestamp month</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>YEAR</name>
                     <description>Timestamp year</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SUBSTEP</name>
                     <description>Sub-step of Core Release</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STEP</name>
                     <description>Step of Core Release</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REL</name>
                     <description>Core Release</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ENDN</name>
               <description>Endian</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x87654321</resetValue>
               <fields>
                  <field>
                     <name>ETV</name>
                     <description>Endianness Test Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CUST</name>
               <description>Customer Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CUST</name>
                     <description>Customer Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBTP</name>
               <description>Fast Bit Timing and Prescaler</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <resetValue>0x00000A33</resetValue>
               <fields>
                  <field>
                     <name>DSJW</name>
                     <description>Data (Re)Synchronization Jump Width</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DTSEG2</name>
                     <description>Data time segment after sample point</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DTSEG1</name>
                     <description>Data time segment before sample point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DBRP</name>
                     <description>Data Baud Rate Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TDC</name>
                     <description>Tranceiver Delay Compensation</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEST</name>
               <description>Test</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LBCK</name>
                     <description>Loop Back Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX</name>
                     <description>Control of Transmit Pin</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXSelect</name>
                        <enumeratedValue>
                           <name>CORE</name>
                           <description>TX controlled by CAN core</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAMPLE</name>
                           <description>TX monitoring sample point</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOMINANT</name>
                           <description>Dominant (0) level at pin CAN_TX</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RECESSIVE</name>
                           <description>Recessive (1) level at pin CAN_TX</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX</name>
                     <description>Receive Pin</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RWD</name>
               <description>RAM Watchdog</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDC</name>
                     <description>Watchdog Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>WDV</name>
                     <description>Watchdog Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
