Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00100.svd
            <register>
               <name>CCCR</name>
               <description>CC Control</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>INIT</name>
                     <description>Initialization</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCE</name>
                     <description>Configuration Change Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASM</name>
                     <description>ASM Restricted Operation Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSA</name>
                     <description>Clock Stop Acknowledge</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSR</name>
                     <description>Clock Stop Request</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MON</name>
                     <description>Bus Monitoring Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAR</name>
                     <description>Disable Automatic Retransmission</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST</name>
                     <description>Test Mode Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FDOE</name>
                     <description>FD Operation Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BRSE</name>
                     <description>Bit Rate Switch Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UTSU</name>
                     <description>Use Timestamping Unit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WMM</name>
                     <description>Wide Message Marker</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PXHD</name>
                     <description>Protocol Exception Handling Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EFBI</name>
                     <description>Edge Filtering during Bus Integration</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXP</name>
                     <description>Transmit Pause</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NBTP</name>
               <description>Nominal Bit Timing and Prescaler</description>
               <addressOffset>0x11C</addressOffset>
               <size>32</size>
               <resetValue>0x06000A03</resetValue>
               <fields>
                  <field>
                     <name>NTSEG2</name>
                     <description>Nominal Time segment after sample point</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NTSEG1</name>
                     <description>Nominal Time segment before sample point</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NBRP</name>
                     <description>Nominal Baud Rate Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NSJW</name>
                     <description>Nominal (Re)Synchronization Jump Width</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSCC</name>
               <description>Timestamp Counter Configuration</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSS</name>
                     <description>Timestamp Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TSSSelect</name>
                        <enumeratedValue>
                           <name>ZERO</name>
                           <description>Timestamp counter value always 0x0000</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INC</name>
                           <description>Timestamp counter value incremented by TCP</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT</name>
                           <description>External timestamp counter value used</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TCP</name>
                     <description>Timestamp Counter Prescaler</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSCV</name>
               <description>Timestamp Counter Value</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSC</name>
                     <description>Timestamp Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCC</name>
               <description>Timeout Counter Configuration</description>
               <addressOffset>0x128</addressOffset>
               <size>32</size>
               <resetValue>0xFFFF0000</resetValue>
               <fields>
                  <field>
                     <name>ETOC</name>
                     <description>Enable Timeout Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOS</name>
                     <description>Timeout Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TOSSelect</name>
                        <enumeratedValue>
                           <name>CONT</name>
                           <description>Continuout operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXEF</name>
                           <description>Timeout controlled by TX Event FIFO</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXF0</name>
                           <description>Timeout controlled by Rx FIFO 0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RXF1</name>
                           <description>Timeout controlled by Rx FIFO 1</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOP</name>
                     <description>Timeout Period</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOCV</name>
               <description>Timeout Counter Value</description>
               <addressOffset>0x12C</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>TOC</name>
                     <description>Timeout Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECR</name>
               <description>Error Counter</description>
               <addressOffset>0x140</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEC</name>
                     <description>Transmit Error Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REC</name>
                     <description>Receive Error Counter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>RP</name>
                     <description>Receive Error Passive</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CEL</name>
                     <description>CAN Error Logging</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSR</name>
               <description>Protocol Status</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000707</resetValue>
               <fields>
                  <field>
                     <name>LEC</name>
                     <description>Last Error Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LECSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUFF</name>
                           <description>Stuff Error</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORM</name>
                           <description>Form Error</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACK</name>
                           <description>Ack Error</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT1</name>
                           <description>Bit1 Error</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT0</name>
                           <description>Bit0 Error</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC</name>
                           <description>CRC Error</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NC</name>
                           <description>No Change</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACT</name>
                     <description>Activity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ACTSelect</name>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>Node is synchronizing on CAN communication</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Node is neither receiver nor transmitter</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RX</name>
                           <description>Node is operating as receiver</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX</name>
                           <description>Node is operating as transmitter</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EP</name>
                     <description>Error Passive</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EW</name>
                     <description>Warning Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BO</name>
                     <description>Bus_Off Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLEC</name>
                     <description>Data Phase Last Error Code</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DLECSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUFF</name>
                           <description>Stuff Error</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FORM</name>
                           <description>Form Error</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACK</name>
                           <description>Ack Error</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT1</name>
                           <description>Bit1 Error</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIT0</name>
                           <description>Bit0 Error</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC</name>
                           <description>CRC Error</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NC</name>
                           <description>No Change</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESI</name>
                     <description>ESI flag of last received CAN FD Message</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RBRS</name>
                     <description>BRS flag of last received CAN FD Message</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFDF</name>
                     <description>Received a CAN FD Message</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PXE</name>
                     <description>Protocol Exception Event</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDCV</name>
                     <description>Transmitter Delay Compensation Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TDCR</name>
               <description>Extended ID Filter Configuration</description>
               <addressOffset>0x148</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TDCF</name>
                     <description>Transmitter Delay Compensation Filter Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>TDCO</name>
                     <description>Transmitter Delay Compensation Offset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
