Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00100.svd
            <register>
               <name>RNG_Control_Registers__InitWaitVal</name>
               <description>Initial wait counter value.</description>
               <addressOffset>0x11034</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>InitWaitVal</name>
                     <description>Number of clock cycles to wait before sampling data from the noise source.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__DisableOsc0</name>
               <description>Disable oscillator rings #0 to #31.</description>
               <addressOffset>0x11038</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DisableOsc0</name>
                     <description>Disable oscillator rings #0 to #31.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__DisableOsc1</name>
               <description>Disable oscillator rings #32 to #63.</description>
               <addressOffset>0x1103C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DisableOsc1</name>
                     <description>Disable oscillator rings #32 to #63.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__SwOffTmrVal</name>
               <description>Switch off timer value.</description>
               <addressOffset>0x11040</addressOffset>
               <size>32</size>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>SwOffTmrVal</name>
                     <description>Number of clk cycles to wait before stopping the rings after the FIFO is full.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__ClkDiv</name>
               <description>Sample clock divider.</description>
               <addressOffset>0x11044</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ClkDiv</name>
                     <description>Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__AIS31Conf0</name>
               <description>AIS31 configuration register 0.</description>
               <addressOffset>0x11048</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>StartUpThreshold</name>
                     <description>Start-up test threshold.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>OnlineThreshold</name>
                     <description>Online threshold.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__AIS31Conf1</name>
               <description>AIS31 configuration register 1.</description>
               <addressOffset>0x1104C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OnlineRepThreshold</name>
                     <description>Online repeat threshold.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>HExpectedValue</name>
                     <description>Expected history value.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__AIS31Conf2</name>
               <description>AIS31 configuration register 2.</description>
               <addressOffset>0x11050</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HMin</name>
                     <description>Minimum allowed history value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>HMa</name>
                     <description>Maximum allowed history value.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__AIS31Status</name>
               <description>AIS31 status register.</description>
               <addressOffset>0x11054</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NumPrelimAlarms</name>
                     <description>Number of preliminary noise alarms since counter was last cleared.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PrelimNoiseAlarmRng</name>
                     <description>Last preliminary noise alarm occurred due to history value out of range.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PrelimNoiseAlarmRep</name>
                     <description>Last preliminary noise alarm occurred due to consecutive high X**2.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNG_Control_Registers__HwConfig</name>
               <description>Hardware configuration register.</description>
               <addressOffset>0x11058</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000037</resetValue>
               <fields>
                  <field>
                     <name>NumbOfRings</name>
                     <description>Generic g_NumRings value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AIS31</name>
                     <description>Generic g_AIS31 value.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AIS31Full</name>
                     <description>Generic g_AIS31Full value.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PK_Registers__Pointers</name>
               <description>Pointers register.</description>
               <addressOffset>0x12000</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OpPtrA</name>
                     <description>When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>OpPtrB</name>
                     <description>When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF).</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>OpPtrC</name>
                     <description>When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>OpPtrN</name>
                     <description>When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF).</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PK_Registers__Command</name>
               <description>Command register.</description>
               <addressOffset>0x12004</addressOffset>
               <size>32</size>
               <resetValue>0x0000000F</resetValue>
               <fields>
                  <field>
                     <name>OpeAddr</name>
                     <description>This field defines the operation to be performed. See documentation for more details.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>FieldF</name>
                     <description>'0': Field is GF(p) '1': Field is GF(2**m)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OpBytesM1</name>
                     <description>This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -&gt; ECC on curve K-163 - 0x01F -&gt; ECC on curve P-256 - 0x02F -&gt; ECC on curve P-384 - 0x033 -&gt; ECC on curve K-409 - 0x041 -&gt; ECC on curve P-521 - 0x07F -&gt; 1024-bit RSA - 0x09F -&gt; 1280-bit RSA - 0x1FF -&gt; 4096-bit RSA - 0x3FF -&gt; 8192-bit RSA</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RandMod</name>
                     <description>Enable randomization of modulus (counter-measure).</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SelCurve</name>
                     <description>Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RandKE</name>
                     <description>Enable randomization of exponent/scalar (counter-measure).</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RandProj</name>
                     <description>Enable randomization of projective coordinates (counter-measure).</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>Edwards</name>
                     <description>Enable Edwards curve (see operation description).</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SwapBytes</name>
                     <description>Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FlagA</name>
                     <description>See operation description.</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FlagB</name>
                     <description>See operation description.</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CalcR2</name>
                     <description>This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PK_Registers__Control</name>
               <description>Command register.</description>
               <addressOffset>0x12008</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Start</name>
                     <description>Writing a '1' starts the processing.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ClearIRQ</name>
                     <description>Writing a '1' clears the IRQ output.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PK_Registers__Status</name>
               <description>Status register.</description>
               <addressOffset>0x1200C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ErrorFlags</name>
                     <description>These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>PK_Busy</name>
                     <description>This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IntrptStatus</name>
                     <description>This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FailPtr</name>
                     <description>These bits indicate which data location generated the error flag. They are not available for all error flags.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PK_Registers__Timer</name>
               <description>Timer register.</description>
               <addressOffset>0x12014</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Timer</name>
                     <description>Number of core clock cycles.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>31</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PK_Registers__HwConfig</name>
               <description>Hardware configuration register.</description>
               <addressOffset>0x12018</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x43F30200</resetValue>
               <fields>
                  <field>
                     <name>MaxOpSize</name>
                     <description>Maximum operand size (number of bytes).</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>NbMult</name>
                     <description>Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PrimeField</name>
                     <description>Support prime field.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BinaryField</name>
                     <description>Support binary field.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC</name>
                     <description>Support RAM error correction.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P256</name>
                     <description>Support ECC P256 acceleration.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P384</name>
                     <description>Support ECC P384 acceleration.</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P521</name>
                     <description>Support ECC P521 acceleration.</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P192</name>
                     <description>Support ECC P192 acceleration.</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>X25519</name>
                     <description>Support Curve25519/Ed25519 acceleration.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHBMaster</name>
                     <description>'0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DisableSM</name>
                     <description>State of DisableSMx input (high when SM2/SM9 operations are disabled).</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DisableClrMem</name>
                     <description>State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled).</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DisableCM</name>
                     <description>State of DisableCM input (high when counter-measures are disabled).</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PK_Registers__OpSize</name>
               <description>Operand size register.</description>
               <addressOffset>0x1201C</addressOffset>
               <size>32</size>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>OpSize</name>
                     <description>Operand size (number of bytes): 0x0100: 256 0x0209: 521 0x0800: 2048 0x0C00: 3072 0x1000: 4096 This register is used when the memory is accessed via AHB Master</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
