Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00100.svd
            <register>
               <name>XOSC32K</name>
               <description>32kHz External Crystal Oscillator (XOSC32K) Control</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00200080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALEN</name>
                     <description>Crystal Oscillator Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Startup Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>1CYCLE</name>
                           <description>1 ULP clock cycle</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16CYCLES</name>
                           <description>16 ULP clock cycles</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32CYCLES</name>
                           <description>32 ULP clock cycles</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2048CYCLES</name>
                           <description>2048 ULP clock cycles</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4096CYCLES</name>
                           <description>4096 ULP clock cycles</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8192CYCLES</name>
                           <description>8192 ULP clock cycles</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16384CYCLES</name>
                           <description>16384 ULP clock cycles</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32768CYCLES</name>
                           <description>32768 ULP clock cycles</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>65536CYCLES</name>
                           <description>65536 ULP clock cycles</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>131072CYCLES</name>
                           <description>131072 ULP clock cycles</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>262144CYCLES</name>
                           <description>262144 ULP clock cycles</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENSL</name>
                     <description>Enable Servo Loop</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOOST</name>
                     <description>Gain Boost</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CGM</name>
                     <description>Control Gain Mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CGMSelect</name>
                        <enumeratedValue>
                           <name>CGM0</name>
                           <description>The lower Control Gain Mode value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM1</name>
                           <description>A higher Control Gain Mode value than CGM0</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM2</name>
                           <description>A higher Control Gain Mode value than CGM1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM3</name>
                           <description>A higher Control Gain Mode value than CGM2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM4</name>
                           <description>A higher Control Gain Mode value than CGM3</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM5</name>
                           <description>A higher Control Gain Mode value than CGM4</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM6</name>
                           <description>A higher Control Gain Mode value than CGM5</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM7</name>
                           <description>A higher Control Gain Mode value than CGM6</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM8</name>
                           <description>A higher Control Gain Mode value than CGM7</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM9</name>
                           <description>A higher Control Gain Mode value than CGM8</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM10</name>
                           <description>A higher Control Gain Mode value than CGM9</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM11</name>
                           <description>A higher Control Gain Mode value than CGM10</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM12</name>
                           <description>A higher Control Gain Mode value than CGM11</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM13</name>
                           <description>A higher Control Gain Mode value than CGM12</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM14</name>
                           <description>A higher Control Gain Mode value than CGM13</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGM15</name>
                           <description>The highest Control Gain Mode value</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTRLX</name>
                     <description>Extended Control</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
