Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00100.svd
            <register>
               <name>QK_CR</name>
               <description>Control register; The Control register defines which command must be executed next. When the command is accepted or rejected, the bits automatically revert to 0. Only one command bit may be written with 1 at a time, with the exception of qk_zeroize. Writing qk_zeroize with 1 takes precedence over all other commands.</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_zeroize</name>
                     <description>Begin Zeroize operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_enroll</name>
                     <description>Begin Enroll operation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_start</name>
                     <description>Begin Start operation</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_reconstruct</name>
                     <description>Begin Reconstruct operation</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_stop</name>
                     <description>Begin Stop operation</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_get_key</name>
                     <description>Begin Get Key operation</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_unwrap</name>
                     <description>Begin Unwrap operation</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_wrap_generated_random</name>
                     <description>Begin Wrap Generated Random operation</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_wrap</name>
                     <description>Begin Wrap operation</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_generate_random</name>
                     <description>Begin Generate Random operation</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_test_memory</name>
                     <description>Begin Test Memory operation</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_test_puf</name>
                     <description>Begin Test PUF operation</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_ORR</name>
               <description>Operation Result register; The Operation Result register provides the result code of the last operation (Initialization, Generate Random, etc.). The value in this register is only valid when qk_busy = 0.</description>
               <addressOffset>0x204</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_result_code</name>
                     <description>Result code of last operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>qk_result_codeSelect</name>
                        <enumeratedValue>
                           <name>IID_QK_OK</name>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_ERR_PRODUCT</name>
                           <value>0xF0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_ERR_PRODUCT_PH2</name>
                           <value>0xF1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_ERR_TRANSFER</name>
                           <value>0xF2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_ERR_TRANSFER_PH2</name>
                           <value>0xF3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_ERR_AUTH</name>
                           <value>0xF4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_ERR_AUTH_PH2</name>
                           <value>0xF5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_ERR_PUF_QUALITY</name>
                           <value>0xF6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_ERR_CONTEXT</name>
                           <value>0xF7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_ERR_DESTINATION</name>
                           <value>0xF8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_FAILURE_SRAM</name>
                           <value>0xFF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>qk_last_operation</name>
                     <description>Number of last operation</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>qk_last_operationSelect</name>
                        <enumeratedValue>
                           <name>IID_QK_LO_PROGRESS</name>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_ENROLL</name>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_START</name>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_RECONSTRUCT</name>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_STOP</name>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_GET_KEY</name>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_UNWRAP</name>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_WRAP_GEN_RND</name>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_WRAP</name>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_GEN_RND</name>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_TEST_MEMORY</name>
                           <value>0x1E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_TEST_PUF</name>
                           <value>0x1F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_INITIALIZATION</name>
                           <value>0x20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IID_QK_LO_ZEROIZE</name>
                           <value>0x2F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_SR</name>
               <description>Status register; The Status register shows the current status of QuiddiKey and indicates whether a data transfer is requested.</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>qk_busy</name>
                     <description>Operation is in progress</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_ok</name>
                     <description>Last operation was successful</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_error</name>
                     <description>Last operation failed</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_zeroized</name>
                     <description>QuiddiKey is in Zeroized or Locked state</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_rejected</name>
                     <description>Read: Last command was rejected Write 1: Clears this bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_di_request</name>
                     <description>Request for data in transfer via the QK_DIR register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_do_request</name>
                     <description>Request for data out transfer via the QK_DOR register</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_AR</name>
               <description>Allow register; The Allow register indicates which operations are currently allowed.</description>
               <addressOffset>0x20C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_allow_enroll</name>
                     <description>0: Enroll operation is not allowed 1: Enroll operation is allowed</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_start</name>
                     <description>0: Start operation is not allowed 1: Start operation is allowed</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_reconstruct</name>
                     <description>0: Reconstruct operation is not allowed 1: Reconstruct operation is allowed</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_stop</name>
                     <description>0: Stop operation is not allowed 1: Stop operation is allowed</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_get_key</name>
                     <description>0: Get Key operation is not allowed 1: Get Key operation is allowed</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_unwrap</name>
                     <description>0: Unwrap operation is not allowed 1: Unwrap operation is allowed</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_wrap_generated_random</name>
                     <description>0: Wrap Generated Random operation is not allowed 1: Wrap Generated Random operation is allowed</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_wrap</name>
                     <description>0: Wrap operation is not allowed 1: Wrap operation is allowed</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_generate_random</name>
                     <description>0: Generate Random operation is not allowed 1: Generate Random operation is allowed</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_test_memory</name>
                     <description>0: Test Memory operation is not allowed 1: Test Memory operation is allowed</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_allow_test_puf</name>
                     <description>0: Test PUF operation is not allowed 1: Test PUF operation is allowed</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_IER</name>
               <description>Interrupt Enable register; With the Interrupt Enable register all QuiddiKey interrupts can be enabled or disabled, without changing the Interrupt Mask register.</description>
               <addressOffset>0x210</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_int_en</name>
                     <description>0: Disables all QuiddiKey interrupts 1: Enables all QuiddiKey interrupts that are enabled in the Interrupt Mask register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_IMR</name>
               <description>Interrupt Mask register; Individual QuiddiKey interrupts can be enabled or disabled with the Interrupt Mask register.</description>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_int_en_busy</name>
                     <description>Enables the busy interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_en_ok</name>
                     <description>Enables the ok interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_en_error</name>
                     <description>Enables the error interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_en_zeroized</name>
                     <description>Enables the zeroized interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_en_rejected</name>
                     <description>Enables the rejected interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_en_di_request</name>
                     <description>Enables the data in request interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_en_do_request</name>
                     <description>Enables the data out request interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_ISR</name>
               <description>Interrupt Status register; The Interrupt Status register indicates which interrupt has occurred. Multiple interrupts may occur at the same time (e.g. the busy interrupt occurs together with one of the ok and error interrupts). Writing 1 to a bit, clears the corresponding bit.</description>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_int_busy</name>
                     <description>A negative edge has occurred on qk_busy, which means that an operation has completed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_ok</name>
                     <description>A positive edge has occurred on qk_ok, which means that an operation successfully completed</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_error</name>
                     <description>A positive edge has occurred on qk_error, which means that an operation has failed</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_zeroized</name>
                     <description>A positive edge has occurred on qk_zeroized, which means that QuiddiKey has moved to the Zeroized or Locked state</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_rejected</name>
                     <description>A positive edge has occurred on qk_rejected, which means that a command was rejected</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_di_request</name>
                     <description>A positive edge has occurred on qk_di_request, which means that a data in transfer is requested via the QK_DIR register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_int_do_request</name>
                     <description>A positive edge has occurred on qk_do_request, which means that a data out transfer is requested via the QK_DOR register</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QK_DATA_DEST</name>
               <description>Data Destination register; The Data Destination register defines via which interface data is made available by QuiddiKey. Only one bit at a time may be 1.</description>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>qk_dest_dor</name>
                     <description>Data will be made available via the QK_DOR register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>qk_dest_so</name>
                     <description>Data will be made available via the SO interface</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
