Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00100.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RSTC</name>
         <version>039261c0</version>
         <description>Reset Controller</description>
         <baseAddress>0x45004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RCAUSE</name>
               <description>Reset Cause</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power On Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORCORE</name>
                     <description>Brown Out CORE Detector Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDREG</name>
                     <description>Brown Out VDDREG Detector Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDA</name>
                     <description>Brown Out VDDA Detector Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDIO</name>
                     <description>Brown Out VDDIO Detector Reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>External Reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT</name>
                     <description>Watchdog Reset</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYST</name>
                     <description>System Reset Request</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BACKUP</name>
                     <description>Backup Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUP</name>
                     <description>Lockup Reset</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKUPEXIT</name>
               <description>Backup Exit Source. Implemented only if RSTC_BACKUP_IMPLEMENTED=1</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RTC</name>
                     <description>Real Timer Counter Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HIB0</name>
                     <description>Hibernate</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LCKUPDIS</name>
                     <description>Lockup Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>RTC</name>
         <version>036083b0</version>
         <description>Real-Time Counter</description>
         <baseAddress>0x45006000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x70</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RTC_TAMPER</name>
            <value>12</value>
         </interrupt>
         <interrupt>
            <name>RTC_OVF</name>
            <value>13</value>
         </interrupt>
         <interrupt>
            <name>RTC_PER0</name>
            <value>14</value>
         </interrupt>
         <interrupt>
            <name>RTC_CMP0</name>
            <value>15</value>
         </interrupt>
         <registers>
            <cluster>
               <name>MODE0</name>
               <description>32-bit Counter with Single 32-bit Compare</description>
               <headerStructName>RtcMode0</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>MODE0 Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>COUNT32</name>
                              <description>Mode 0: 32-bit Counter</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>COUNT16</name>
                              <description>Mode 1: 16-bit Counter</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLOCK</name>
                              <description>Mode 2: Clock/Calendar</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MATCHCLR</name>
                        <description>Clear on Match</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PRESCALER</name>
                        <description>Prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>PRESCALERSelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/1</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV1</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/1</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV2</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/2</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV4</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/4</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV8</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/8</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV16</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/16</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV32</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/32</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV64</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/64</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV128</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/128</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV256</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/256</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV512</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/512</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV1024</name>
                              <description>CLK_RTC_CNT = GCLK_RTC/1024</description>
                              <value>0xB</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>GPTRST</name>
                        <description>GP Registers Reset On Tamper Enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COUNTSYNC</name>
                        <description>Count Read Synchronization Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>MODE0 Control B</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>GP0EN</name>
                        <description>General Purpose 0 Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GP2EN</name>
                        <description>General Purpose 2 Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBMAJ</name>
                        <description>Debouncer Majority Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBASYNC</name>
                        <description>Debouncer Asynchronous Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RTCOUT</name>
                        <description>RTC Output Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DMAEN</name>
                        <description>DMA Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DEBF</name>
                        <description>Debounce Frequency</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>DEBFSelect</name>
                           <enumeratedValue>
                              <name>DIV2</name>
                              <description>CLK_RTC_DEB = CLK_RTC/2</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV4</name>
                              <description>CLK_RTC_DEB = CLK_RTC/4</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV8</name>
                              <description>CLK_RTC_DEB = CLK_RTC/8</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV16</name>
                              <description>CLK_RTC_DEB = CLK_RTC/16</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV32</name>
                              <description>CLK_RTC_DEB = CLK_RTC/32</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV64</name>
                              <description>CLK_RTC_DEB = CLK_RTC/64</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV128</name>
                              <description>CLK_RTC_DEB = CLK_RTC/128</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV256</name>
                              <description>CLK_RTC_DEB = CLK_RTC/256</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ACTF</name>
                        <description>Active Layer Frequency</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>ACTFSelect</name>
                           <enumeratedValue>
                              <name>DIV2</name>
                              <description>CLK_RTC_OUT = CLK_RTC/2</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV4</name>
                              <description>CLK_RTC_OUT = CLK_RTC/4</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV8</name>
                              <description>CLK_RTC_OUT = CLK_RTC/8</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV16</name>
                              <description>CLK_RTC_OUT = CLK_RTC/16</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV32</name>
                              <description>CLK_RTC_OUT = CLK_RTC/32</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV64</name>
                              <description>CLK_RTC_OUT = CLK_RTC/64</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV128</name>
                              <description>CLK_RTC_OUT = CLK_RTC/128</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DIV256</name>
                              <description>CLK_RTC_OUT = CLK_RTC/256</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SEPTO</name>
                        <description>Separate Tamper Outputs</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
